PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16lf18344.inc
_WDTE_OFF            EQU  H'3FF3'; WDT disabled; SWDTEN is ignored
_WDTE_SWDTEN         EQU  H'3FF7'; WDT controlled by the SWDTEN bit in the WDTCON register
_WDTE_SLEEP          EQU  H'3FFB'; WDT enabled while running and disabled in SLEEP/IDLE; SWDTEN is ignored
_WDTE_ON             EQU  H'3FFF'; WDT enabled, SWDTEN is ignored

_LPBOREN_ON          EQU  H'3FDF'; ULPBOR enabled
_LPBOREN_OFF         EQU  H'3FFF'; ULPBOR disabled

_BOREN_OFF           EQU  H'3F3F'; Brown-out Reset disabled
_BOREN_SBOREN        EQU  H'3F7F'; Brown-out Reset enabled according to SBOREN
_BOREN_SLEEP         EQU  H'3FBF'; Brown-out Reset enabled while running, disabled in Sleep; SBOREN is ignored
_BOREN_ON            EQU  H'3FFF'; Brown-out Reset enabled, SBOREN bit ignored

_BORV_HIGH           EQU  H'3DFF'; Brown-out voltage (Vbor) set to 2.7V
_BORV_LOW            EQU  H'3FFF'; Brown-out voltage (Vbor) set to 2.45V

_PPS1WAY_OFF         EQU  H'37FF'; The PPSLOCK bit can be set and cleared repeatedly (subject to the unlock sequence)
_PPS1WAY_ON          EQU  H'3FFF'; The PPSLOCK bit can be cleared and set only once; PPS registers remain locked after one clear/set cycle

_STVREN_OFF          EQU  H'2FFF'; Stack Overflow or Underflow will not cause a Reset
_STVREN_ON           EQU  H'3FFF'; Stack Overflow or Underflow will cause a Reset

_DEBUG_ON            EQU  H'1FFF'; Background debugger enabled
_DEBUG_OFF           EQU  H'3FFF'; Background debugger disabled

;----- CONFIG3 Options --------------------------------------------------
_WRT_ALL             EQU  H'3FFC'; 0000h to 0FFFh write protected, no addresses may be modified
_WRT_HALF            EQU  H'3FFD'; 0000h to 03FFh write-protected, 0400h to 0FFFh may be modified
_WRT_BOOT            EQU  H'3FFE'; 0000h to 01FFh write-protected, 0200h to 0FFFh may be modified
_WRT_OFF             EQU  H'3FFF'; Write protection off

_LVP_OFF             EQU  H'1FFF'; High Voltage on MCLR/VPP must be used for programming.
_LVP_ON              EQU  H'3FFF'; Low Voltage programming enabled. MCLR/VPP pin function is MCLR. MCLRE configuration bit is ignored.

;----- CONFIG4 Options --------------------------------------------------
_CP_ON               EQU  H'3FFE'; User NVM code protection enabled
_CP_OFF              EQU  H'3FFF'; User NVM code protection disabled

_CPD_ON              EQU  H'3FFD'; Data NVM code protection enabled
_CPD_OFF             EQU  H'3FFF'; Data NVM code protection disabled

;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'8006'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'8000'
_IDLOC1          EQU  H'8001'
_IDLOC2          EQU  H'8002'
_IDLOC3          EQU  H'8003'

        LIST
